
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 16 to add, 0 to change, 16 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_config[&#34;0&#34;]
  * azurerm_storage_blob.b2c_config[&#34;1&#34;]
  * azurerm_storage_blob.b2c_config[&#34;10&#34;]
  * azurerm_storage_blob.b2c_config[&#34;11&#34;]
  * azurerm_storage_blob.b2c_config[&#34;12&#34;]
  * azurerm_storage_blob.b2c_config[&#34;13&#34;]
  * azurerm_storage_blob.b2c_config[&#34;14&#34;]
  * azurerm_storage_blob.b2c_config[&#34;15&#34;]
  * azurerm_storage_blob.b2c_config[&#34;2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;3&#34;]
  * azurerm_storage_blob.b2c_config[&#34;4&#34;]
  * azurerm_storage_blob.b2c_config[&#34;5&#34;]
  * azurerm_storage_blob.b2c_config[&#34;6&#34;]
  * azurerm_storage_blob.b2c_config[&#34;7&#34;]
  * azurerm_storage_blob.b2c_config[&#34;8&#34;]
  * azurerm_storage_blob.b2c_config[&#34;9&#34;]
* Delete
  * azurerm_storage_blob.b2c_copyright_png
  * azurerm_storage_blob.b2c_favicon
  * azurerm_storage_blob.b2c_favicon_svg
  * azurerm_storage_blob.b2c_font_bold_v2_2_woff2
  * azurerm_storage_blob.b2c_font_bold_v2_woff
  * azurerm_storage_blob.b2c_font_light_v2_2_woff2
  * azurerm_storage_blob.b2c_font_light_v2_woff
  * azurerm_storage_blob.b2c_govuk_crest_2x_png
  * azurerm_storage_blob.b2c_govuk_crest_png
  * azurerm_storage_blob.b2c_govuk_icon_180_png
  * azurerm_storage_blob.b2c_icon_mask_svg
  * azurerm_storage_blob.b2c_login_html
  * azurerm_storage_blob.b2c_logo_gov
  * azurerm_storage_blob.b2c_main_css
  * azurerm_storage_blob.b2c_mfa_css
  * azurerm_storage_blob.b2c_mfa_html


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["0"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "97d7f655444ded5cb86b0bddfda76afa"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "login.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/login.html"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["1"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "2c32693834e83a99f4cb0ff2a39d207f"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "main.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/main.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["10"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "ae577696a9d0466ee2019f46ec4c684f"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-icon-180.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/govuk-icon-180.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["11"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "ff75b23964656ce28eece43f266d9f1d"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-icon-mask.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/govuk-icon-mask.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["12"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "0c9e8639ea578c52504c066c5b805508"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "logo_gov.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/logo_gov.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["13"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "2c32693834e83a99f4cb0ff2a39d207f"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "main.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/main.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["14"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "4f23b1397bc211d0f5d3f4ca720c3901"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "mfa.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/mfa.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["15"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "ad720484bf391450e55d8293e443e34f"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "mfa.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/mfa.html"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["2"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "ba68e29f2b8d6c98bbe820e2bf565ad2"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "copyright.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/copyright.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["3"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "favicon.ico"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/favicon.ico"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["4"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "0c9e8639ea578c52504c066c5b805508"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "logo_gov.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/logo_gov.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["5"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "e1321ba525137ed156ed48e69369531c"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "favicon.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/favicon.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["6"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "affa96571d94a9ab7d95b0850b26edde"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "bold-affa96571d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/bold-affa96571d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["7"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "bold-b542beb274-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/bold-b542beb274-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["8"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "57a05afc1fc634420a02ff0151675de0"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-crest-2x.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/govuk-crest-2x.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["9"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "bcd5768bd7721641ee71ba103bb38900"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-crest.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/assets/govuk-crest.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_copyright_png will be destroyed
  # (because azurerm_storage_blob.b2c_copyright_png is not in configuration)
  - resource "azurerm_storage_blob" "b2c_copyright_png" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ba68e29f2b8d6c98bbe820e2bf565ad2" -> null
      - content_type           = "image/x-png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/copyright.png" -> null
      - metadata               = {} -> null
      - name                   = "copyright.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/copyright.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/copyright.png" -> null
    }

  # azurerm_storage_blob.b2c_favicon will be destroyed
  # (because azurerm_storage_blob.b2c_favicon is not in configuration)
  - resource "azurerm_storage_blob" "b2c_favicon" {
      - access_tier            = "Hot" -> null
      - content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6" -> null
      - content_type           = "image/x-icon" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> null
      - metadata               = {} -> null
      - name                   = "favicon.ico" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/favicon.ico" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> null
    }

  # azurerm_storage_blob.b2c_favicon_svg will be destroyed
  # (because azurerm_storage_blob.b2c_favicon_svg is not in configuration)
  - resource "azurerm_storage_blob" "b2c_favicon_svg" {
      - access_tier            = "Hot" -> null
      - content_md5            = "e1321ba525137ed156ed48e69369531c" -> null
      - content_type           = "image/svg+xml" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.svg" -> null
      - metadata               = {} -> null
      - name                   = "favicon.svg" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/favicon.svg" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.svg" -> null
    }

  # azurerm_storage_blob.b2c_font_bold_v2_2_woff2 will be destroyed
  # (because azurerm_storage_blob.b2c_font_bold_v2_2_woff2 is not in configuration)
  - resource "azurerm_storage_blob" "b2c_font_bold_v2_2_woff2" {
      - access_tier            = "Hot" -> null
      - content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-b542beb274-v2.woff2" -> null
      - metadata               = {} -> null
      - name                   = "bold-b542beb274-v2.woff2" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/bold-b542beb274-v2.woff2" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-b542beb274-v2.woff2" -> null
    }

  # azurerm_storage_blob.b2c_font_bold_v2_woff will be destroyed
  # (because azurerm_storage_blob.b2c_font_bold_v2_woff is not in configuration)
  - resource "azurerm_storage_blob" "b2c_font_bold_v2_woff" {
      - access_tier            = "Hot" -> null
      - content_md5            = "affa96571d94a9ab7d95b0850b26edde" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-affa96571d-v2.woff" -> null
      - metadata               = {} -> null
      - name                   = "bold-affa96571d-v2.woff" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/bold-affa96571d-v2.woff" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/bold-affa96571d-v2.woff" -> null
    }

  # azurerm_storage_blob.b2c_font_light_v2_2_woff2 will be destroyed
  # (because azurerm_storage_blob.b2c_font_light_v2_2_woff2 is not in configuration)
  - resource "azurerm_storage_blob" "b2c_font_light_v2_2_woff2" {
      - access_tier            = "Hot" -> null
      - content_md5            = "94a07e06a104e76fe40583f74b204aee" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/light-94a07e06a1-v2.woff2" -> null
      - metadata               = {} -> null
      - name                   = "light-94a07e06a1-v2.woff2" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/light-94a07e06a1-v2.woff2" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/light-94a07e06a1-v2.woff2" -> null
    }

  # azurerm_storage_blob.b2c_font_light_v2_woff will be destroyed
  # (because azurerm_storage_blob.b2c_font_light_v2_woff is not in configuration)
  - resource "azurerm_storage_blob" "b2c_font_light_v2_woff" {
      - access_tier            = "Hot" -> null
      - content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e" -> null
      - content_type           = "application/octet-stream" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/light-f591b13f7d-v2.woff" -> null
      - metadata               = {} -> null
      - name                   = "light-f591b13f7d-v2.woff" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/light-f591b13f7d-v2.woff" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/light-f591b13f7d-v2.woff" -> null
    }

  # azurerm_storage_blob.b2c_govuk_crest_2x_png will be destroyed
  # (because azurerm_storage_blob.b2c_govuk_crest_2x_png is not in configuration)
  - resource "azurerm_storage_blob" "b2c_govuk_crest_2x_png" {
      - access_tier            = "Hot" -> null
      - content_md5            = "57a05afc1fc634420a02ff0151675de0" -> null
      - content_type           = "image/x-png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest-2x.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-crest-2x.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/govuk-crest-2x.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest-2x.png" -> null
    }

  # azurerm_storage_blob.b2c_govuk_crest_png will be destroyed
  # (because azurerm_storage_blob.b2c_govuk_crest_png is not in configuration)
  - resource "azurerm_storage_blob" "b2c_govuk_crest_png" {
      - access_tier            = "Hot" -> null
      - content_md5            = "bcd5768bd7721641ee71ba103bb38900" -> null
      - content_type           = "image/x-png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-crest.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/govuk-crest.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-crest.png" -> null
    }

  # azurerm_storage_blob.b2c_govuk_icon_180_png will be destroyed
  # (because azurerm_storage_blob.b2c_govuk_icon_180_png is not in configuration)
  - resource "azurerm_storage_blob" "b2c_govuk_icon_180_png" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ae577696a9d0466ee2019f46ec4c684f" -> null
      - content_type           = "image/x-png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-180.png" -> null
      - metadata               = {} -> null
      - name                   = "govuk-icon-180.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/govuk-icon-180.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-180.png" -> null
    }

  # azurerm_storage_blob.b2c_icon_mask_svg will be destroyed
  # (because azurerm_storage_blob.b2c_icon_mask_svg is not in configuration)
  - resource "azurerm_storage_blob" "b2c_icon_mask_svg" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ff75b23964656ce28eece43f266d9f1d" -> null
      - content_type           = "image/svg+xml" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-mask.svg" -> null
      - metadata               = {} -> null
      - name                   = "govuk-icon-mask.svg" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/govuk-icon-mask.svg" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/govuk-icon-mask.svg" -> null
    }

  # azurerm_storage_blob.b2c_login_html will be destroyed
  # (because azurerm_storage_blob.b2c_login_html is not in configuration)
  - resource "azurerm_storage_blob" "b2c_login_html" {
      - access_tier            = "Hot" -> null
      - content_md5            = "97d7f655444ded5cb86b0bddfda76afa" -> null
      - content_type           = "text/html" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> null
      - metadata               = {} -> null
      - name                   = "login.html" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/login.html" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> null
    }

  # azurerm_storage_blob.b2c_logo_gov will be destroyed
  # (because azurerm_storage_blob.b2c_logo_gov is not in configuration)
  - resource "azurerm_storage_blob" "b2c_logo_gov" {
      - access_tier            = "Hot" -> null
      - content_md5            = "0c9e8639ea578c52504c066c5b805508" -> null
      - content_type           = "image/x-png" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/logo_gov.png" -> null
      - metadata               = {} -> null
      - name                   = "logo_gov.png" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/logo_gov.png" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/logo_gov.png" -> null
    }

  # azurerm_storage_blob.b2c_main_css will be destroyed
  # (because azurerm_storage_blob.b2c_main_css is not in configuration)
  - resource "azurerm_storage_blob" "b2c_main_css" {
      - access_tier            = "Hot" -> null
      - content_md5            = "2c32693834e83a99f4cb0ff2a39d207f" -> null
      - content_type           = "text/css" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> null
      - metadata               = {} -> null
      - name                   = "main.css" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/main.css" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/main.css" -> null
    }

  # azurerm_storage_blob.b2c_mfa_css will be destroyed
  # (because azurerm_storage_blob.b2c_mfa_css is not in configuration)
  - resource "azurerm_storage_blob" "b2c_mfa_css" {
      - access_tier            = "Hot" -> null
      - content_md5            = "4f23b1397bc211d0f5d3f4ca720c3901" -> null
      - content_type           = "text/css" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.css" -> null
      - metadata               = {} -> null
      - name                   = "mfa.css" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/mfa.css" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.css" -> null
    }

  # azurerm_storage_blob.b2c_mfa_html will be destroyed
  # (because azurerm_storage_blob.b2c_mfa_html is not in configuration)
  - resource "azurerm_storage_blob" "b2c_mfa_html" {
      - access_tier            = "Hot" -> null
      - content_md5            = "ad720484bf391450e55d8293e443e34f" -> null
      - content_type           = "text/html" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.html" -> null
      - metadata               = {} -> null
      - name                   = "mfa.html" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/mfa.html" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/mfa.html" -> null
    }

Plan: 16 to add, 0 to change, 16 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":731,"Program":"tfcmt","SHA1":"","Vars":{}} -->